---
type: Panel
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# Panel

`Autodesk.Revit.DB.Panel` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | FindHostPanel | 2015 | `public ElementId FindHostPanel ()` |
| Method | GetRefGridLines | — | `public void GetRefGridLines ( ref ElementId uGridLineId , ref ElementId vGridLineId )` |
| Property | FromRoom | — | `` |
| Property | Lockable | — | `public bool Lockable { get ; }` |
| Property | PanelType | — | `public PanelType PanelType { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Room | — | `` |
| Property | Space | — | `` |
| Property | ToRoom | — | `` |
| Property | Transform | — | `public Transform Transform { get ; }` |